Tekla Open API Reference for Tekla Structures 2025
LineAttributes Constructor
Overload List
Name | Description
Line.LineAttributes()
 Creates a new default line attributes instance that loads standard attributes.
Line.LineAttributes(String)
 Creates a new line attributes instance that loads the specified attributes.
Top
See Also
Reference
Line.LineAttributes Class
Tekla.Structures.Drawing Namespace